OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f66k90.h
extern __at(0x0F2F) volatile __CM2CONbits_t CM2CONbits;

#define _CM2CON_CCH0            0x01
#define _CM2CON_CCH1            0x02
#define _CM2CON_CREF            0x04
#define _CM2CON_EVPOL0          0x08
#define _CM2CON_EVPOL1          0x10
#define _CM2CON_CPOL            0x20
#define _CM2CON_COE             0x40
#define _CM2CON_CON             0x80

//==============================================================================


//==============================================================================
//        CM2CON1 Bits

extern __at(0x0F2F) __sfr CM2CON1;

typedef union
  {
  struct
    {
    unsigned CCH0               : 1;
    unsigned CCH1               : 1;
    unsigned CREF               : 1;
    unsigned EVPOL0             : 1;
    unsigned EVPOL1             : 1;
    unsigned CPOL               : 1;
    unsigned COE                : 1;
    unsigned CON                : 1;
    };

  struct
    {
    unsigned CCH                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned EVPOL              : 2;
    unsigned                    : 3;
    };
  } __CM2CON1bits_t;

extern __at(0x0F2F) volatile __CM2CON1bits_t CM2CON1bits;

#define _CM2CON1_CCH0           0x01
#define _CM2CON1_CCH1           0x02
#define _CM2CON1_CREF           0x04
#define _CM2CON1_EVPOL0         0x08
#define _CM2CON1_EVPOL1         0x10
#define _CM2CON1_CPOL           0x20
#define _CM2CON1_COE            0x40
#define _CM2CON1_CON            0x80

//==============================================================================


//==============================================================================
//        T12CON Bits

extern __at(0x0F30) __sfr T12CON;

typedef union
  {
  struct
    {
    unsigned T12CKPS0           : 1;
    unsigned T12CKPS1           : 1;
    unsigned TMR12ON            : 1;
    unsigned T12OUTPS0          : 1;
    unsigned T12OUTPS1          : 1;
    unsigned T12OUTPS2          : 1;
    unsigned T12OUTPS3          : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T12CKPS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T12OUTPS           : 4;
    unsigned                    : 1;
    };
  } __T12CONbits_t;

extern __at(0x0F30) volatile __T12CONbits_t T12CONbits;

#define _T12CKPS0               0x01
#define _T12CKPS1               0x02
#define _TMR12ON                0x04
#define _T12OUTPS0              0x08
#define _T12OUTPS1              0x10
#define _T12OUTPS2              0x20
#define _T12OUTPS3              0x40

//==============================================================================

extern __at(0x0F31) __sfr PR12;
extern __at(0x0F32) __sfr TMR12;

//==============================================================================
//        T10CON Bits

extern __at(0x0F33) __sfr T10CON;

typedef union
  {
  struct
    {
    unsigned T10CKPS0           : 1;
    unsigned T10CKPS1           : 1;
    unsigned TMR10ON            : 1;
    unsigned T10OUTPS0          : 1;
    unsigned T10OUTPS1          : 1;
    unsigned T10OUTPS2          : 1;
    unsigned T10OUTPS3          : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T10CKPS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T10OUTPS           : 4;
    unsigned                    : 1;
    };
  } __T10CONbits_t;

extern __at(0x0F33) volatile __T10CONbits_t T10CONbits;

#define _T10CKPS0               0x01
#define _T10CKPS1               0x02
#define _TMR10ON                0x04
#define _T10OUTPS0              0x08
#define _T10OUTPS1              0x10
#define _T10OUTPS2              0x20
#define _T10OUTPS3              0x40

//==============================================================================

extern __at(0x0F34) __sfr PR10;
extern __at(0x0F35) __sfr TMR10;

//==============================================================================
//        T8CON Bits

extern __at(0x0F36) __sfr T8CON;

typedef union
  {
  struct
    {
    unsigned T8CKPS0            : 1;
    unsigned T8CKPS1            : 1;
    unsigned TMR8ON             : 1;
    unsigned T8OUTPS0           : 1;
    unsigned T8OUTPS1           : 1;
    unsigned T8OUTPS2           : 1;
    unsigned T8OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T8CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T8OUTPS            : 4;
    unsigned                    : 1;
    };
  } __T8CONbits_t;

extern __at(0x0F36) volatile __T8CONbits_t T8CONbits;

#define _T8CKPS0                0x01
#define _T8CKPS1                0x02
#define _TMR8ON                 0x04
#define _T8OUTPS0               0x08
#define _T8OUTPS1               0x10
#define _T8OUTPS2               0x20
#define _T8OUTPS3               0x40

//==============================================================================

extern __at(0x0F37) __sfr PR8;
extern __at(0x0F38) __sfr TMR8;

//==============================================================================
//        T6CON Bits

extern __at(0x0F39) __sfr T6CON;

typedef union
  {
  struct
    {
    unsigned T6CKPS0            : 1;
    unsigned T6CKPS1            : 1;
    unsigned TMR6ON             : 1;
    unsigned T6OUTPS0           : 1;
    unsigned T6OUTPS1           : 1;
    unsigned T6OUTPS2           : 1;
    unsigned T6OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T6CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T6OUTPS            : 4;
    unsigned                    : 1;
    };
  } __T6CONbits_t;

extern __at(0x0F39) volatile __T6CONbits_t T6CONbits;

#define _T6CKPS0                0x01
#define _T6CKPS1                0x02
#define _TMR6ON                 0x04
#define _T6OUTPS0               0x08
#define _T6OUTPS1               0x10
#define _T6OUTPS2               0x20
#define _T6OUTPS3               0x40

//==============================================================================

extern __at(0x0F3A) __sfr PR6;
extern __at(0x0F3B) __sfr TMR6;

//==============================================================================
//        T7GCON Bits

extern __at(0x0F3C) __sfr T7GCON;

typedef union
  {
  struct
    {
    unsigned T7GSS0             : 1;
    unsigned T7GSS1             : 1;
    unsigned T7GVAL             : 1;
    unsigned T7GGO_NOT_T7DONE   : 1;
    unsigned T7GSPM             : 1;
    unsigned T7GTM              : 1;
    unsigned T7GPOL             : 1;
    unsigned TMR7GE             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T7GGO              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_T7DONE         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T7GSS              : 2;
    unsigned                    : 6;
    };
  } __T7GCONbits_t;

extern __at(0x0F3C) volatile __T7GCONbits_t T7GCONbits;

#define _T7GSS0                 0x01
#define _T7GSS1                 0x02
#define _T7GVAL                 0x04
#define _T7GGO_NOT_T7DONE       0x08
#define _T7GGO                  0x08
#define _NOT_T7DONE             0x08
#define _T7GSPM                 0x10
#define _T7GTM                  0x20
#define _T7GPOL                 0x40
#define _TMR7GE                 0x80

//==============================================================================


//==============================================================================
//        T7CON Bits

extern __at(0x0F3D) __sfr T7CON;

typedef union
  {
  struct
    {
    unsigned TMR7ON             : 1;
    unsigned RD16               : 1;
    unsigned NOT_T7SYNC         : 1;
    unsigned SOSCEN             : 1;
    unsigned T7CKPS0            : 1;
    unsigned T7CKPS1            : 1;
    unsigned TMR7CS0            : 1;
    unsigned TMR7CS1            : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T7CKPS             : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned TMR7CS             : 2;
    };
  } __T7CONbits_t;

